src/InformationRegisters/ШтрихкодыОперацийНаПроизводстве/ШтрихкодыОперацийНаПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыОперацийНаПроизводстве</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиНаПроизводстве</types>
    </type>
  </resources>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ШтрихкодыОперацийНаПроизводстве/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  КодОперации - Строка
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Сотрудник, Знач КодОперации, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.КодОперации = КодОперации;
    Запись.Штрихкод = Штрихкод;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  КодОперации - Строка
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Сотрудник, Знач КодОперации, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.КодОперации = КодОперации;
    Запись.Штрихкод = Штрихкод;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
Процедура УдалитьШтрихкодыСотрудника(Знач Сотрудник) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.УдалитьДляСотрудника(Сотрудник);

КонецПроцедуры

#КонецОбласти
